app/views/blogs/_blog.html.erb

<h3>Blogs</h3>
<% Blog.limit(4).each do |blog| %>
---
SELECT  "blogs".* FROM "blogs" LIMIT 5 OFFSET 0