app/views/blogs/_user.html.erb

SELECT "users".* FROM "users"
---
<h3>Users</h3>
<% User.all.limit(2).each do |user| %>