app/views/blogs/index.html.erb

SELECT COUNT(*) FROM "blogs" WHERE "blogs"."category" = ?  [["category", "admin"]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "users"
---
      <p id='insert0' >
      <span id='blog-num' align='right'>There are <%= Blog.where(category: 'admin').count %> blogs</span>
      <span id='user-num' align='right'>There are <%= User.count %> users </span>