app/controllers/blogs_controller.rb

   def index
      #Rails.logger.debug "----Out #{params}"
      @user = User.first
      @count = @user.blogs.count
      @users = User.all
      @blogs = Blog.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "blogs".* FROM "blogs" LIMIT 5 OFFSET 0