app/controllers/blogs_controller.rb

   def index
      #Rails.logger.debug "----Out #{params}"
      @user = User.first
      @count = @user.blogs.count
      user = User.where(id:1).first
      sum = User.pluck(:id).sum
      if User.where(id: 1).exists?
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

   def count_stats
      @count2 = User.second.blogs.count
---
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."user_id" = ?  [["user_id", 2]]

   def show
      size = 5
      @users = User.all
      a = 5
      if a == 5
         @blogs = Blog.all.paginate(:page => params[:page], :per_page => 5)
      end
      b = Blog.first
      b.id
      Blog.find(b.id)
---
SELECT "users".* FROM "users"
SELECT  "blogs".* FROM "blogs"  ORDER BY "blogs"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "blogs"
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ?  ORDER BY "blogs"."id" ASC LIMIT 1  [["id", 1]]